using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace TesterBase
{

    /*!
     * \brief
     * Класс, который является хостом для результатов
     * тестирования пользовательского решения поставленной
     * задачи по программированию.
     */

    public class ProgramTestingResult
    {

        ///////////////////////////////////////////////////
        /// Раздел объявления необходимых переменных.
        ///////////////////////////////////////////////////

        public Test[] testingResults; //!< Массив, содержащий информацию о тестировании пользовательского решения

        ///////////////////////////////////////////////////
        /// Метод является переопределением стандартного
        /// конструктора текущего класса.
        ///////////////////////////////////////////////////

        public ProgramTestingResult(int testsCount)
        {
            
            // Инициализируем массив результатов тестирования
            testingResults = new Test[testsCount];

        }

        ///////////////////////////////////////////////////
        /// Метод возвращает строку, которая содержит
        /// информацию о результатах тестирования
        /// пользовательской программы.
        ///////////////////////////////////////////////////

        public string GetResultAsLine(char splitter)
        {
            
            /*
             * Объявляем временную переменную, в которой
             * будем хранить результат работы метода
             **/
            string resultLine;

            try
            {

                // С помощью LINQ запроса формируем строку результата
                resultLine = testingResults.Aggregate("", (current, test) => current + (test.Result + splitter));

                /*
                 * Удаляем все ненужные символы
                 **/
                resultLine = resultLine.Trim('\n', '\r');

            }
            catch (Exception)
            {

                // Если что-то сломалось, возвращаем пустоту
                resultLine = "";

            }

            // Возвращаем сформированную строку
            return resultLine;

        }

        ///////////////////////////////////////////////////
        /// Метод возвращает строку, которая содержит
        /// информацию о кодах выхода пользовательского
        /// процесса на всех тестах.
        ///////////////////////////////////////////////////

        public string GetExitCodesAsLine(char splitter)
        {

            /*
             * Объявляем временную переменную, в которой
             * будем хранить результат работы метода
             **/
            string resultLine;

            try
            {

                // С помощью LINQ запроса формируем строку результата
                resultLine = testingResults.Aggregate("", (current, test) => current + (test.ExitCode + splitter));

                /*
                 * Удаляем все ненужные символы
                 **/
                resultLine = resultLine.Trim('\n', '\r');

            }
            catch (Exception)
            {

                // Если что-то сломалось, возвращаем пустоту
                resultLine = "";

            }

            // Возвращаем сформированную строку
            return resultLine;

        }

        ///////////////////////////////////////////////////
        /// Метод возвращает строку, которая содержит
        /// информацию об использованной процессом памяти
        /// во время каждого теста.
        ///////////////////////////////////////////////////

        public string GetUsedMemoryAsLine(char splitter)
        {

            /*
             * Объявляем временную переменную, в которой
             * будем хранить результат работы метода
             **/
            string resultLine;

            try
            {

                // С помощью LINQ запроса формируем строку результата
                resultLine = testingResults.Aggregate("", (current, test) => current + (test.UsedMemory + splitter));

                /*
                 * Удаляем все ненужные символы
                 **/
                resultLine = resultLine.Trim('\n', '\r');

            }
            catch (Exception)
            {

                // Если что-то сломалось, возвращаем пустоту
                resultLine = "";

            }

            // Возвращаем сформированную строку
            return resultLine;

        }

        ///////////////////////////////////////////////////
        /// Метод возвращает строку, которая содержит
        /// информацию об использованной процессом
        /// процессорного времени во время каждого теста.
        ///////////////////////////////////////////////////

        public string GetUsedProcessorTimeAsLine(char splitter)
        {

            /*
             * Объявляем временную переменную, в которой
             * будем хранить результат работы метода
             **/
            string resultLine;

            try
            {

                // С помощью LINQ запроса формируем строку результата
                resultLine = testingResults.Aggregate("", (current, test) => current + (test.UsedProcessorTime + splitter));

                /*
                 * Удаляем все ненужные символы
                 **/
                resultLine = resultLine.Trim(splitter);

            }
            catch (Exception)
            {

                // Если что-то сломалось, возвращаем пустоту
                resultLine = "";

            }

            // Возвращаем сформированную строку
            return resultLine;

        }

        ///////////////////////////////////////////////////
        /// Метод возвращает строку исключений тестируемой
        /// программы, которая собрана со всех тестов
        ///////////////////////////////////////////////////

        public string GetErrorOutputAsLine()
        {

            /*
             * Объявляем временную переменную, в которой
             * будем хранить результат работы метода
             **/
            string resultLine;

            try
            {

                // С помощью LINQ запроса формируем строку результата
                resultLine = testingResults.Aggregate("", (current, test) => current + (test.ErrorOutput + "\r\n"));

                /*
                 * Удаляем все ненужные символы
                 **/
                resultLine = resultLine.Trim('\n', '\r');

            }
            catch (Exception)
            {

                // Если что-то сломалось, возвращаем пустоту
                resultLine = "";

            }

            // Возвращаем сформированную строку
            return resultLine;

        }

        ///////////////////////////////////////////////////
        /// Метод возвращает булевое значение, которое
        /// гласит о том, успешно ли пройдены все тесты,
        /// или нет. Ошибок, вроде, не должно возникать.
        ///////////////////////////////////////////////////

        public bool IsSuccessful()
        {

            /*
             * Выполняем LINQ запрос на выборку и проверку, после
             * чего возвращаем результат выполнения метода.
             **/
            return testingResults.Aggregate(true, (current, test) => current && test.IsSuccessful);

        }

        ///////////////////////////////////////////////////

    }

    /*!
     * \brief
     * Класс, который является примитивом единичного
     * теста заданного пользовательского решения данной
     * задачи по программированию.
     */

    public class Test
    {

        ///////////////////////////////////////////////////
        /// Раздел объявления используемых переменных
        ///////////////////////////////////////////////////

        public readonly char Result; //!< Результат по текущему тесту

        public readonly int ExitCode; //!< Код выхода пользовательской программы

        public readonly int UsedMemory; //!< Использование памяти пользовательской программой

        public readonly int UsedProcessorTime; //!< Использование процессорного времени пользовательской программой

        public readonly string ErrorOutput; //!< Выходной поток ошибок пользовательской программы

        public bool IsSuccessful => (Result == '+' && ExitCode == 0); //!< Указывает на то, пройден ли тест или нет

        ///////////////////////////////////////////////////
        /// Метод является переопределением стандартного
        /// конструктора текущего класса.
        ///////////////////////////////////////////////////

        public Test(char Result, int ExitCode, int UsedMemory, int UsedProcessorTime, string ErrorOutput)
        {

            this.Result = Result;
            this.ExitCode = ExitCode;
            this.UsedMemory = UsedMemory;
            this.UsedProcessorTime = UsedProcessorTime;
            this.ErrorOutput = ErrorOutput;

        }

        ///////////////////////////////////////////////////

    }

}
